# Term Project Spring 2020 - Team Game Cancelled
___

_Test the integrity of your new CourseData.db database._

Write queries to ensure that ...
- Each column has a sensible data type (Domain integrity); are there truncation or translation errors?
- Each row describes a unique entity (Entity integrity); just having a PK is not enough: you will need to look for duplicate a data records
- Each relationship is implemented correctly (Relational integrity); are the FKs JOIN-compatible with the PKs? does each mandatory relationship have a corresponding NOT NULL constraint?
- Annotate your queries in Markdown cells so we know what you are testing and why.

<b> Table of Contents: </b>
<br> [1. Set Up - SQL and Database](#00)
<br> [2. Testing Data Type for Each Column](#10)
<br> [3. Testing Each Row Describes a Unique Entity](#20)
<br> [4. Testing Each Table Relationship](#30)
___

<a id = "00"> <h2> 1. Set Up - SQL and Database </h2> </a>

### Imports

In [6]:
%load_ext sql
import pandas as pd
import sqlite3

In [7]:
%sql sqlite:///CourseData.db
conn = sqlite3.connect('CourseData.db')

<a id = "10"> <h2> 2. Testing Data Type for Each Column </h2> </a>

In [17]:
%%sql 
-- Testing Instructors Table

SELECT *
FROM Instructors
LIMIT 10

 * sqlite:///CourseData.db
Done.

[(1, 'Michael P.  Coyne'),
 (2, 'Rebecca I.  Bloch'),
 (3, 'Paul   Caster'),
 (4, 'Jo Ann   Drusbosky'),
 (5, 'Arleen N.  Kardos'),
 (6, 'Scott M  Brenner'),
 (7, 'Kevin C.  Cassidy'),
 (8, 'Bruce   Bradford'),
 (9, 'Milo W.  Peck'),
 (10, 'Stephen E.  Yost')]

In [ ]:
%%sql 
-- Testing Programs Table

In [ ]:
%%sql 
-- Testing Course Catalogs Table

In [16]:
%%sql 
-- Testing Course Offerings T

SELECT *
FROM COURSE_OFFERINGS
WHERE CRN = '70384'

 * sqlite:///CourseData.db
Done.

[(1, 'Fall2014', 70384, 'AC 0011', 'C01', '3.000', 'Introduction to Financial Accounting', "['TF 0800am-0915am 09/02-12/08 DSB 105']", 'Michael P.  Coyne', 0, 31, -31)]

In [ ]:
%%sql 
-- Testing Instructors Table

<a id = "20"> <h2> 3. Testing Each Row Describes a Unique Entity </h2> </a>

ADD NOTES HERE WITH WHAT WE'RE DOING

In [18]:
%%sql
SELECT 
    (SELECT Count(*) FROM COURSE_CATALOGS) as CatalogCourses,
    (SELECT Count(*) FROM COURSE_OFFERINGS) as CourseOfferings,
    (SELECT Count(*) FROM COURSE_MEETINGS) as CourseMeetings;

 * sqlite:///CourseData.db
Done.

[(4440, 15937, 284847)]

<a id = "30"> <h2> 4. Testing Each Table Relationship </h2> </a>

_Testing the Relationship Between Course Meetings and Course Offerings_

In [9]:
%%sql
-- A check of the COURSE_MEETINGS --> COURSE_OFFERINGS relationship
SELECT Term, CourseID, Count(CourseMeetingID)
FROM COURSE_OFFERINGS 
    JOIN COURSE_MEETINGS USING (CRN)
    WHERE CRN = 39006 and Term = 'Spring2016';

 * sqlite:///CourseData.db
Done.

[('Spring2016', 10006, 37)]

_Testing the Relationship Between Course Meetings and Location_

In [10]:
%%sql
-- A check of the COURSE_MEETINGS --> Location
SELECT Location.LocationID, COUNT(CourseMeetingID), StartDateTime
FROM COURSE_MEETINGS 
    JOIN Location USING (LocationID)
    WHERE StartDateTime = '2014-09-02T08:00:00' and LocationID = 'DSB 105';

 * sqlite:///CourseData.db
Done.

[('DSB 105', 1, '2014-09-02T08:00:00')]

_Testing the Relationship Between Course Offerings and Instructors_

In [11]:
%%sql
-- A check of the COURSE_OFFERINGS --> Instructors

SELECT CourseID, Term, CRN, Section, Title, Actual, Capacity, Remaining, Instructors.Name, InstructorID
FROM COURSE_OFFERINGS
    LEFT JOIN INSTRUCTORS ON (COURSE_OFFERINGS.PrimaryInstructorID = Instructors.Name)
    WHERE Name like '%Huntley' and Term = 'Fall2014'  
    LIMIT 5;

 * sqlite:///CourseData.db
Done.

[(747, 'Fall2014', 70369, 'E', 'Intro to Information Systems', 26, 25, -1, 'Christopher L.  Huntley', 272),
 (752, 'Fall2014', 73060, 'A', 'Fundamentals of Web Design', 26, 25, -1, 'Christopher L.  Huntley', 272),
 (756, 'Fall2014', 73061, 'A', 'Systems Design and Implementation', 16, 25, 9, 'Christopher L.  Huntley', 272)]

_Testing the Relationship Between Course Offerings and Catalogs_

In [14]:
-- A check of COURSE_OFFERINGS --> COURSE_CATALOGS
%%sql 
SELECT CourseCatalog.CourseID,

SyntaxError: invalid syntax (<ipython-input-14-9a23ef6061a8>, line 1)

_Testing the Relationship Between Course Catalogs and Programs_

# 6. Empty out Tables to Reclaim Storage